{
    "personal-information": {
        "name": "Javier Rengel Jimenez",
        "title": "Senior Backend Software Engineer",
        "education": "BSc in Computer Engineering at Málaga University",
        "contact": {
            "email": "javier@rengel.me, javier@coconauts.net",
            "telephone": "+44 7435230551",
            "website": "http://rengel.me",
            "linkedin": "https://www.linkedin.com/pub/javier-rengel-jimenez/56/865/432/en",
            "twitter": "http://twitter.com/rephus",
            "facebook": "https://www.facebook.com/rephus",
            "github": "https://github.com/rephus"
        }
    },
    "working-experience": {
        "network-locum": {
            "url": "https://networklocum.com",
            "started": "2015-12-15",
            "description": "Network Locum is a market network that unifies Practices and",
            "insight": "Smart team of people with different approaches to work.",
            "higlights": [
                "Full microservices architecture using Docker and Rancher",
                "Input on important architectural decissions",
                "Backend mostly built in Python3, Django and Flask and a bit of Scala.",
                "TDD and BDD",
                "Continuous integration using Jenkins and Travis",
                "Conducted software developer interviews",
                "Mentoring other members of the team"
            ]
        },
        "top10": {
            "started": "2013-05-01",
            "finished": "2015-12-01",
            "description": "Top10 was a hotel metasearch startup company based in London, taking advantage of brand new web technologies and good marketing campaigns.",
            "insight": "It was a small startup with a team of top-talent engineers,",
            "higlights": [
                "Backend microservices development in Scala",
                "Full custom CMS app built in Scala Play Framework",
                "CI with Jenkins",
                "Polyglot persistence with Cassandra, Memcached, ElasticSearch, Redis",
                "Heavy use of Amazon WS DynamoDB, EC2, S3, SQS, SNS, etc"
            ]
        },
        "openbet-ltd": {
            "url": "http://www.openbet.com",
            "started": "2012-10-15",
            "finished": "2013-05-01",
            "description": "Openbet are the world's leading provider of interactive gaming and betting solutions. Established in 1996, and with offices in USA, Australia and the UK, provides solutions for all of the mayor companies in the online gaming industry, including William Hill, Ladbrokes, Paddy Power, or Betfair.",
            "insight": "While the codebase and project was not very flashy, I learned how it feels working in a large company with a large team and I also was introduced to agile standups, code reviews",
            "highlights": [
                "Web backend development for sportsbook sites in Tcl",
                "Troubleshooting, QA, optimization and code analysis for existing products",
                "Automation scripts in Bash and Expect",
                "Tests server management using Puppet and Bash scripting",
                "Release manager: in charge or the team's code merging, code deployment, and direct support towards clients"
            ]
        },
        "asesores-locales-consultoria-sa": {
            "url": "http://www.asesoreslocales.com",
            "started": "2009-07-01",
            "finished": "2012-09-25",
            "description": "Asesores locales is a well renowned medium-size consultancy company based in Madrid, Malaga and Cadiz Spain. It's main line of business is the development of software for local goverments, as well as training in several fields. Other clients include companies both spanish and international.",
            "insight": "Asesores Locales was my first job as a developer.",
            "highlights": [
                "JEE development in several projects, as part of teams and autonomously",
                "UI with IceFaces, Jboss Richfaces, ADF and Woodstock frameworks",
                "GIS system development in JEE using MapServer for custom street location service",
                "Installation, configuration and maintenance of IBM servers with Windows Server 2008 R2 and CentOS",
                "Administration of Oracle, MySQL and PostgreSQL databases",
                "Application servers Glassfish v2/v3 and Oracle weblogic",
                "VMWare VSphere hypervisor 5.0 administration",
                "Product presentations inside and outside the company",
                "Internal training",
                "Manager role in some projects"
            ]
        }
    },
    "attitudes": [
        "Enthusiast and curious: continously learning and trying new technologies and languages on my sparte time",
        "High-speed learner",
        "Motivation to solve difficult problems",
        "Friendly person, excellent working with teams, as well as independently",
        "Result oriented, massive efficiency in achieving solutions",
        "Capable of managing small teams, and mentoring people, both technical and not technical"
    ],
    "personal-projects": [
        "http://retrophies.win, a web emulator of NES games with Achievements and multiplayer gameplay via websockets.",
        "http://coconauts.net/projects/watchduino2/, a smartwatch based",
        "Casual mobile videogames released for Android platform since v1.6 https://play.google.com/store/apps/developer?id=Coconauts",
        "http://coconauts.net/projects/gramola/, a web-based music player written in Node.js",
        "http://coconauts.net/projects/podcast/ about development in spanish"
    ]
}